In [1]:
import pandas as pd

In [2]:
# Merge: unimos dataframes por columnas en común

# Idea clave antes de empezar

Education está en CLH (clientes)

Flights Booked está en CFA (actividad)

Hay relación 1 cliente → muchos vuelos

NO se puede analizar esto sin unir los datasets primero.

In [3]:
df_clh = pd.read_csv("./files/CLH.csv")
df_clh

,Loyalty Number,Country,Province,City,Postal Code,Gender,Education,Salary,Marital Status,Loyalty Card,CLV,Enrollment Type,Enrollment Year,Enrollment Month,Cancellation Year,Cancellation Month
0,480934,Canada,Ontario,Toronto,M2Z 4K1,Female,Bachelor,83236.0,Married,Star,3839.14,Standard,2016,2,NaN,NaN
1,549612,Canada,Alberta,Edmonton,T3G 6Y6,Male,College,NaN,Divorced,Star,3839.61,Standard,2016,3,NaN,NaN
2,429460,Canada,British Columbia,Vancouver,V6E 3D9,Male,College,NaN,Single,Star,3839.75,Standard,2014,7,2018.0,1.0
3,608370,Canada,Ontario,Toronto,P1W 1K4,Male,College,NaN,Single,Star,3839.75,Standard,2013,2,NaN,NaN
4,530508,Canada,Quebec,Hull,J8Y 3Z5,Male,Bachelor,103495.0,Married,Star,3842.79,Standard,2014,10,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
16732,823768,Canada,British Columbia,Vancouver,V6E 3Z3,Female,College,NaN,Married,Star,61850.19,Standard,2012,12,NaN,NaN
16733,680886,Canada,Saskatchewan,Regina,S1J 3C5,Female,Bachelor,89210.0,Married,Star,67907.27,Standard,2014,9,NaN,NaN
16734,776187,Canada,British Columbia,Vancouver,V5R 1W3,Male,College,NaN,Single,Star,74228.52,Standard,2014,3,NaN,NaN
16735,906428,Canada,Yukon,Whitehorse,Y2K 6R0,Male,Bachelor,-57297.0,Married,Star,10018.66,2018 Promotion,2018,4,NaN,NaN
16736,652627,Canada,Manitoba,Winnipeg,R2C 0M5,Female,Bachelor,75049.0,Married,Star,83325.38,Standard,2015,12,2016.0,8.0

In [4]:
df_cfa = pd.read_csv("./files/CFA.csv")
df_cfa

,Loyalty Number,Year,Month,Flights Booked,Flights with Companions,Total Flights,Distance,Points Accumulated,Points Redeemed,Dollar Cost Points Redeemed
0,100018,2017,1,3,0,3,1521,152.0,0,0
1,100102,2017,1,10,4,14,2030,203.0,0,0
2,100140,2017,1,6,0,6,1200,120.0,0,0
3,100214,2017,1,0,0,0,0,0.0,0,0
4,100272,2017,1,0,0,0,0,0.0,0,0
...,...,...,...,...,...,...,...,...,...,...
405619,999902,2018,12,0,0,0,0,0.0,0,0
405620,999911,2018,12,0,0,0,0,0.0,0,0
405621,999940,2018,12,3,0,3,1233,123.0,0,0
405622,999982,2018,12,0,0,0,0,0.0,0,0
405623,999986,2018,12,0,0,0,0,0.0,0,0

In [5]:
df_merged = df_cfa.merge(
    df_clh[['Loyalty Number', 'Education']],
    on='Loyalty Number',
    how='inner'
)

In [6]:
df_merged.shape

(405624, 11)

In [7]:
df_merged

,Loyalty Number,Year,Month,Flights Booked,Flights with Companions,Total Flights,Distance,Points Accumulated,Points Redeemed,Dollar Cost Points Redeemed,Education
0,100018,2017,1,3,0,3,1521,152.0,0,0,Bachelor
1,100102,2017,1,10,4,14,2030,203.0,0,0,College
2,100140,2017,1,6,0,6,1200,120.0,0,0,College
3,100214,2017,1,0,0,0,0,0.0,0,0,Bachelor
4,100272,2017,1,0,0,0,0,0.0,0,0,Bachelor
...,...,...,...,...,...,...,...,...,...,...,...
405619,999902,2018,12,0,0,0,0,0.0,0,0,College
405620,999911,2018,12,0,0,0,0,0.0,0,0,Doctor
405621,999940,2018,12,3,0,3,1233,123.0,0,0,Bachelor
405622,999982,2018,12,0,0,0,0,0.0,0,0,College
405623,999986,2018,12,0,0,0,0,0.0,0,0,Bachelor

In [8]:
df_merged.duplicated().sum()

np.int64(1864)

In [9]:
df_merged[df_merged.duplicated()].head()

,Loyalty Number,Year,Month,Flights Booked,Flights with Companions,Total Flights,Distance,Points Accumulated,Points Redeemed,Dollar Cost Points Redeemed,Education
42,101902,2017,1,0,0,0,0,0.0,0,0,College
227,112142,2017,1,0,0,0,0,0.0,0,0,Bachelor
478,126100,2017,1,0,0,0,0,0.0,0,0,Master
567,130331,2017,1,0,0,0,0,0.0,0,0,Bachelor
660,135421,2017,1,0,0,0,0,0.0,0,0,Bachelor

In [10]:
df_analysis = df_merged[['Loyalty Number', 'Flights Booked', 'Education']]
df_analysis.head()

   Loyalty Number  Flights Booked Education
0          100018               3  Bachelor
1          100102              10   College
2          100140               6   College
3          100214               0  Bachelor
4          100272               0  Bachelor

In [11]:
df_analysis.shape

(405624, 3)